In [1]:
import numpy as np
import pandas as pd

In [2]:
# 데이터 읽기
survey = pd.read_csv("c:/data/mva/survey.csv")
survey.head(3)

   seq  sex  marriage  age  job  edu  salary
0    1    1         1   21    1    4      60
1    2    1         1   22    5    5     100
2    3    1         1   33    1    4     200

In [3]:
# 평균 구하기
survey["age"].mean()

34.275

In [4]:
# 표준편차 구하기
survey["age"].std()

11.602359397542536

In [6]:
# 범주형 변수로 변환하기
survey["sex"] = survey["sex"].astype("category")
survey["job"] = survey["job"].astype("category")
survey["edu"] = survey["edu"].astype("category")
survey.marriage = survey.marriage.astype("category")

In [7]:
# 연속인 변수의 기술통계량 구하기
survey.iloc[:, 1:].describe()

             age     salary
count  40.000000   40.00000
mean   34.275000  130.22500
std    11.602359   72.19258
min    20.000000   50.00000
25%    24.750000   77.50000
50%    32.000000  105.00000
75%    42.500000  175.00000
max    59.000000  349.00000

In [9]:
# 나이에 대한 평균 및 표준편차
agestat_by_sex = survey.groupby("sex")["age"].describe()
agestat_by_sex

     count       mean        std   min   25%   50%   75%   max
sex
1     27.0  33.962963  11.969453  20.0  24.0  32.0  43.0  59.0
2     13.0  34.923077  11.243232  21.0  26.0  33.0  41.0  56.0